{
  "Part II Findings and Observations": ". Requirement Number and Definition: <Enter Response Here> Identify the customized control name / identifier for each control used to meet the Customized Approach Objective. (Note: use the Customized Control name from the assessed entity's controls matrix) <Enter Response Here> Describe each control used to meet the Customized Approach Objective. (Note: Refer to the Payment Card Industry Data Security Standard (PCI DSS) Requirements and Testing Procedures for the Customized Approach Objective) <Enter Response Here> Describe how the control(s) meet the Customized Approach Objective. <Enter Response Here> Identify the Controls Matrix documentation reviewed that supports a customized approach for this requirement. <Enter Response Here> Identify the Targeted Risk Analysis documentation reviewed that supports the customized approach for this requirement. <Enter Response Here> Identify name(s) of the assessor(s) who attests that: • The entity completed the Controls Matrix including all information specified in the Controls Matrix Template in Appendix E1 of Payment Card Industry Data Security Standard (PCI DSS) Requirements and Testing Procedures and the results of the Controls Matrix support the customized approach for this requirement. • The entity completed the Targeted Risk Analysis including all information specified in the Targeted Risk Analysis Template in Appendix E2 of Payment Card Industry Data Security Standard (PCI DSS) Requirements and Testing Procedures, and that the results of the Risk Analysis support use of the customized approach for this requirement. <Report Name(s) of Assessor(s) Here> Describe the testing procedures derived and performed by the assessor to validate that the implemented controls meet the Customized Approach Objective; for example, whether the customized control(s) is sufficiently robust to provide at least an equivalent level of protection as provided by the defined approach. Note 1: Technical reviews (for example, reviewing configuration settings, operating effectiveness, etc.) should be performed where possible and appropriate. Note 2: Add additional rows for each assessor-derived testing procedure, as needed. Ensure that all rows to the right of the \"Assessor-derived testing procedure\" are copied for each assessor-derived testing procedure that is added. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 470 <Assessor-derived testing procedure> Identify what was tested (for example, individuals interviewed, system components reviewed, processes observed, etc.) Note: all items tested must be uniquely identified. <Enter Response Here> Identify all evidence examined for this testing procedure. <Enter Response Here> Describe the results of the testing performed by the assessor for this testing procedure and how these results verify the implemented controls meet the Customized Approach Objective. <Enter Response Here> Document the testing procedures derived and performed by the assessor to validate the controls are maintained to ensure ongoing effectiveness; for example, how the entity monitors for control effectiveness and how control failures are detected, responded to, and the actions taken. Note 1: Technical reviews (for example, reviewing configuration settings, operating effectiveness, etc.) should be performed where possible and appropriate. Note 2: Add additional rows for each assessor-derived testing procedure, as needed. Ensure that all rows to the right of the \"Assessor-derived testing procedure\" are copied for each assessor-derived testing procedure that is added. <Assessor-derived testing procedure> Identify what was tested (for example, individuals interviewed, system components reviewed, processes observed, etc.) Note: all items tested must be uniquely identified. <Enter Response Here> Identify all evidence examined for this testing procedure. <Enter Response Here> Describe the results of the testing performed by the assessor for this testing procedure and how these results verify the implemented controls are maintained to ensure ongoing effectiveness. <Enter Response Here>",
  "Requirement 1: Install and Maintain Network Security Controls": "Requirement Description 1.1 Processes and mechanisms for installing and maintaining network security controls are defined and understood. PCI DSS Requirement 1.1.1 All security policies and operational procedures that are identified in Requirement 1 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 2: Apply Secure Configurations to All System Components": "Requirement Description 2.1 Processes and mechanisms for applying secure configurations to all system components are defined and understood. PCI DSS Requirement 2.1.1 All security policies and operational procedures that are identified in Requirement 2 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 3: Protect Stored Account Data": "Requirement Description 3.1 Processes and mechanisms for protecting stored account data are defined and understood. PCI DSS Requirement 3.1.1 All security policies and operational procedures that are identified in Requirement 3 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 4: Protect Cardholder Data with Strong Cryptography During Transmission Over Open, Public Networks": "Requirement Description 4.1 Processes and mechanisms for protecting cardholder data with strong cryptography during transmission over open, public networks are defined and documented. PCI DSS Requirement 4.1.1 All security policies and operational procedures that are identified in Requirement 4 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 5: Protect All Systems and Networks from Malicious Software": "Requirement Description 5.1 Processes and mechanisms for protecting all systems and networks from malicious software are defined and understood. PCI DSS Requirement 5.1.1 All security policies and operational procedures that are identified in Requirement 5 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 6: Develop and Maintain Secure Systems and Software": "Requirement Description 6.1 Processes and mechanisms for developing and maintaining secure systems and software are defined and understood. PCI DSS Requirement 6.1.1 All security policies and operational procedures that are identified in Requirement 6 are: • Documented. • Kept up to date. • In use. • Known to all affected parties. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 162",
  "Requirement 7: Restrict Access to System Components and Cardholder Data by Business Need to Know": "Requirement Description 7.1 Processes and mechanisms for restricting access to system components and cardholder data by business need to know are defined and understood. PCI DSS Requirement 7.1.1 All security policies and operational procedures that are identified in Requirement 7 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 8: Identify Users and Authenticate Access to System Components": "Requirement Description 8.1 Processes and mechanisms for identifying users and authenticating access to system components are defined and understood. PCI DSS Requirement 8.1.1 All security policies and operational procedures that are identified in Requirement 8 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 9: Restrict Physical Access to Cardholder Data": "Requirement Description 9.1 Processes and mechanisms for restricting physical access to cardholder data are defined and understood. PCI DSS Requirement 9.1.1 All security policies and operational procedures that are identified in Requirement 9 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 10: Log and Monitor All Access to System Components and Cardholder Data": "Requirement Description 10.1 Processes and mechanisms for logging and monitoring all access to system components and cardholder data are defined and documented. PCI DSS Requirement 10.1.1 All security policies and operational procedures that are identified in Requirement 10 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 11: Test Security of Systems and Networks Regularly": "Requirement Description 11.1 Processes and mechanisms for regularly testing security of systems and networks are defined and understood. PCI DSS Requirement 11.1.1 All security policies and operational procedures that are identified in Requirement 11 are: • Documented. • Kept up to date. • In use. • Known to all affected parties.",
  "Requirement 12: Support Information Security with Organizational Policies and Programs": "Requirement Description 12.1 A comprehensive information security policy that governs and provides direction for protection of the entity's information assets is known and current. PCI DSS Requirement 12.1.1 An overall information security policy is: • Established. • Published. • Maintained. • Disseminated to all relevant personnel, as well as to relevant vendors and business partners.",
  "A1 Additional PCI DSS Requirements for Multi-Tenant Service Providers": "Requirement Description A1.1 Multi-tenant service providers protect and separate all customer environments and data. PCI DSS Requirement A1.1.1 Logical separation is implemented as follows: • The provider cannot access its customers' environments without authorization. • Customers cannot access the provider's environment without authorization. Note: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 450",
  "A2 Additional PCI DSS Requirements for Entities Using SSL/Early TLS for Card-Present POS POI Terminal Connections": "Requirement Description A2.1 POI terminals using SSL and/or early TLS are confirmed as not susceptible to known SSL/TLS exploits. PCI DSS Requirement A2.1.1 Where POS POI terminals at the merchant or payment acceptance location use SSL and/or early TLS, the entity confirms the devices are not susceptible to any known exploits for those protocols.",
  "A3 Designated Entities Supplemental Validation (DESV)": "This Appendix applies only to entities designated by a payment brand(s) or acquirer as requiring additional validation of existing PCI DSS requirements. Entities that are required to validate to these requirements should refer to the following documents for reporting:  PCI DSS v4.0 Supplemental Report on Compliance Template - Designated Entities Supplemental Validation  PCI DSS v4.0 Supplemental Attestation of Compliance for Report on Compliance - Designated Entities Supplemental Validation These documents are available in the PCI SSC Document Library. Note that an entity is ONLY required to undergo an assessment according to this Appendix if instructed to do so by an acquirer or a payment brand. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 464",
  "Appendix B Compensating Controls": "Compensating controls may be considered when an entity cannot meet a PCI DSS requirement explicitly as stated, due to legitimate and documented technical or business constraints but has sufficiently mitigated the risk associated with not meeting the requirement through implementation of other, or compensating, controls. Compensating controls must satisfy the following criteria: 1. Meet the intent and rigor of the original PCI DSS requirement. 2. Provide a similar level of defense as the original PCI DSS requirement, such that the compensating control sufficiently offsets the risk that the original PCI DSS requirement was designed to defend against. To understand the intent of a requirement, see the Customized Approach Objective for most PCI DSS requirements. If a requirement is not eligible for the Customized Approach and therefore does not have a Customized Approach Objective, refer to the Purpose in the Guidance column for that requirement. 3. Be \"above and beyond\" other PCI DSS requirements. (Simply being in compliance with other PCI DSS requirements is not a compensating control.) 4. When evaluating \"above and beyond\" for compensating controls, consider the following: Note: All compensating controls must be reviewed and validated for sufficiency by the assessor who conducts the PCI DSS assessment. The effectiveness of a compensating control is dependent on the specifics of the environment in which the control is implemented, the surrounding security controls, and the configuration of the control. Entities should be aware that a given compensating control will not be effective in all environments. a. Existing PCI DSS requirements CANNOT be considered as compensating controls if they are already required for the item under review. For example, passwords for non-console administrative access must be sent encrypted to mitigate the risk of intercepting cleartext administrative passwords. An entity cannot use other PCI DSS password requirements (intruder lockout, complex passwords, etc.) to compensate for the lack of encrypted passwords, since those other password requirements do not mitigate the risk of interception of cleartext passwords. Also, the other password controls are already PCI DSS requirements for the item under review (passwords). b. Existing PCI DSS requirements MAY be considered as compensating controls if they are required for another area but are not required for the item under review. c. Existing PCI DSS requirements may be combined with new controls to become a compensating control. For example, if a company is unable to address a vulnerability that is exploitable through a network interface because a security update is not yet available from a vendor, a compensating control could consist of controls that include all of the following: 1) internal network segmentation, 2) limiting network access to the vulnerable interface to only required devices (IP address or MAC address filtering), and 3) IDS/IPS monitoring of all traffic destined to the vulnerable interface. 5. Address the additional risk imposed by not adhering to the PCI DSS requirement. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 465 6. Address the requirement currently and in the future. A compensating control cannot address a requirement that was missed in the past (for example, where the performance of a task was required two quarters ago, but that task was not performed). The assessor is required to thoroughly evaluate compensating controls during each annual PCI DSS assessment to confirm that each compensating control adequately addresses the risk that the original PCI DSS requirement was designed to address, per items 1-6 above. To maintain compliance, processes and controls must be in place to ensure compensating controls remain effective after the assessment is complete. Additionally, compensating control results must be documented in the applicable report for the assessment (for example, a Report on Compliance or a Self-Assessment Questionnaire) in the corresponding PCI DSS requirement section, and included when the applicable report is submitted to the requesting organization. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 466",
  "Appendix C Compensating Controls Worksheet": "Use this worksheet to document any instance where a compensating control is used to meet a PCI DSS defined requirement. Note that compensating controls must also be documented at the corresponding PCI DSS requirement in",
  "Appendix D Customized Approach": "This approach is intended for entities that decide to meet a PCI DSS requirement's stated Customized Approach Objective in a way that does not strictly follow the defined requirement. The customized approach allows an entity to take a strategic approach to meeting a requirement's Customized Approach Objective, so it can determine and design the security controls needed to meet the objective in a manner unique for that organization. The entity implementing a customized approach must satisfy the following criteria:  Document and maintain evidence about each customized control, including all information specified in the Controls Matrix Template in Appendix E1 of the Payment Card Industry Data Security Standard (PCI DSS) Requirements and Testing Procedures.  Perform and document a targeted risk analysis (PCI DSS Requirement 12.3.2) for each customized control, including all information specified in the Targeted Risk Analysis Template in Appendix E2 of the Payment Card Industry Data Security Standard (PCI DSS) Requirements and Testing Procedures.  Perform testing of each customized control to prove effectiveness, and document testing performed, methods used, what was tested, when testing was performed, and results of testing in the controls matrix.  Monitor and maintain evidence about the effectiveness of each customized control.  Provide completed controls matrix(es), targeted risk analysis, testing evidence, and evidence of customized control effectiveness to its assessor. The assessor performing an assessment of customized controls must satisfy the following criteria:  Review the entity's controls matrix(es), targeted risk analysis, and evidence of control effectiveness to fully understand the customized control(s) and to verify the entity meets all Customized Approach documentation and evidence requirements.  Derive and document the appropriate testing procedures needed to conduct thorough testing of each customized control.  Test each customized control to determine whether the entity's implementation 1) meets the requirement's Customized Approach Objective and 2) results in an \"in place\" finding for the requirement.  At all times, QSAs maintain independence requirements defined in the QSA Qualification Requirements. This means if a QSA is involved in designing or implementing a customized control, that QSA does not also derive testing procedures for, assess, or assist with the assessment of that customized control.  The entity and its assessor are expected to work together to ensure 1) they agree that the customized control(s) fully meets the customized approach objective, 2) the assessor fully understands the customized control, and 3) the entity understands the derived testing the assessor will perform.  Use of the customized approach must be completed by a QSA or ISA and documented in accordance with instructions in the Report on Compliance (ROC) Template and following the instructions in the FAQs for use with PCI DSS v4.0 ROC Template available on the PCI SSC website. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 468  Entities that complete a Self-Assessment Questionnaire are not eligible to use a customized approach; however, these entities may elect to have a QSA or ISA perform their assessment and document it in a ROC Template.  The use of the customized approach may be regulated by organizations that manage compliance programs (for example, payment brands and acquirers). Therefore, questions about use of a customized approach must be referred to those organizations, including, for example, whether an entity is required to use a QSA, or may use an ISA to complete an assessment using the customized approach. Note: Compensating controls are not an option with the customized approach. Because the customized approach allows an entity to determine and design the controls needed to meet a requirement's Customized Approach Objective, the entity is expected to effectively implement the controls it designed for that requirement without needing to also implement alternate, compensating controls. PCI DSS v4.0 ROC Template r1 December 2022 © 2006 - 2022 PCI Security Standards Council, LLC. All rights reserved. Page 469",
  "Appendix E Customized Approach Template": "Use this template to document each instance where a customized control is used to meet a PCI DSS requirement. Note that each use of the Customized Approach must also be documented at the corresponding PCI DSS requirement in"

}